In [1]:
#Qn3. Import libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

In [2]:
#Qn3. Import data
path = r'C:\Users\Hiroshi\Documents\12-2023 Instacart Basket Analysis'
df_cust = pd.read_csv(os.path.join(path, '02 Data', '01 Original Data', 'customers.csv'))

In [3]:
#Qn4.
#Checking columns and data sample of customer data.
df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [4]:
#Checking the shape of customer data.
df_cust.shape

(206209, 10)

In [5]:
#Checking the data type of columns in customer data.
df_cust.dtypes

user_id          int64
First Name      object
Surnam          object
Gender          object
STATE           object
Age              int64
date_joined     object
n_dependants     int64
fam_status      object
income           int64
dtype: object

In [3]:
#Change data type
df_cust['user_id'] = df_cust['user_id'].astype('str')

In [6]:
#Qn5
#Checking for mixed-type columns in customer data.
for col in df_cust.columns.tolist():
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_cust[weird]) > 0:
    print (col)

C:\Users\Hiroshi\AppData\Local\Temp\ipykernel_10568\2714615855.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\Hiroshi\AppData\Local\Temp\ipykernel_10568\2714615855.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\Hiroshi\AppData\Local\Temp\ipykernel_10568\2714615855.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\Hiroshi\AppData\Local\Temp\ipykernel_10568\2714615855.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\Hiroshi\AppData\Local\Temp\ipykernel_10568\2714615855.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)

First Name

C:\Users\Hiroshi\AppData\Local\Temp\ipykernel_10568\2714615855.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\Hiroshi\AppData\Local\Temp\ipykernel_10568\2714615855.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\Hiroshi\AppData\Local\Temp\ipykernel_10568\2714615855.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\Hiroshi\AppData\Local\Temp\ipykernel_10568\2714615855.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)
C:\Users\Hiroshi\AppData\Local\Temp\ipykernel_10568\2714615855.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_cust[[col]].applymap(type) != df_cust[[col]].iloc[0].apply(type)).any(axis = 1)

In [4]:
#Convert data type of First Name column to string.
df_cust['First Name'] = df_cust['First Name'].astype('str')

In [8]:
#Check for missing values.
df_cust.isnull().sum()
#No missing values.

user_id         0
First Name      0
Surnam          0
Gender          0
STATE           0
Age             0
date_joined     0
n_dependants    0
fam_status      0
income          0
dtype: int64

In [9]:
#Check for duplicates
df_dups = df_cust[df_cust.duplicated()]
#No duplicates.

In [10]:
df_dups

Empty DataFrame
Columns: [user_id, First Name, Surnam, Gender, STATE, Age, date_joined, n_dependants, fam_status, income]
Index: []

In [15]:
#Check basic statistics.
df_cust.describe()
#No irregularity.

                 Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000
mean       49.501646       1.499823   94632.852548
std        18.480962       1.118433   42473.786988
min        18.000000       0.000000   25903.000000
25%        33.000000       0.000000   59874.000000
50%        49.000000       1.000000   93547.000000
75%        66.000000       3.000000  124244.000000
max        81.000000       3.000000  593901.000000

In [5]:
#Qn6. Combine data
# Import order data
ords_prods_merge_updated2 = pd.read_pickle(os.path.join(path, '02 Data', '02 Prepared Data', 'ords_prods_merge_updated2.pkl'))

In [20]:
# Check data type of key
ords_prods_merge_updated2.dtypes

order_id                            int32
user_id                             int32
order_number                         int8
order_dow                            int8
order_hour_of_day                    int8
days_since_prior_order            float16
first_order                          int8
product_id                          int32
add_to_cart_order                    int8
reordered                            int8
product_name                       object
aisle_id                          float64
department_id                     float64
prices                            float64
_merge                           category
price_range_loc                    object
busiest_day                        object
busiest_2days                      object
busiest_period_of_day              object
max_order                            int8
loyalty_flag                       object
mean_price                        float64
spending_flag                      object
median_days_since_prior_order     float16
order_freq_flag                    object
dtype: object

In [8]:
# Change data type of key
ords_prods_merge_updated2['user_id'] = ords_prods_merge_updated2['user_id'].astype('str')
#Troubleshoot memory error
df_cust['Age'] = df_cust['Age'].astype('int8')
df_cust['n_dependants'] = df_cust['n_dependants'].astype('int8')
df_cust['income'] = df_cust['income'].astype('int32')

In [13]:
# Combine data
ords_prods_merge_updated2.drop(columns = ['_merge'],inplace=True)
ords_prods_cust_merge = ords_prods_merge_updated2.merge(df_cust, on = 'user_id', indicator=True, how = 'left')

In [16]:
#Qn8. Export data
ords_prods_cust_merge.to_pickle(os.path.join(path, '02 Data','02 Prepared Data', 'ords_prods_cust_merge.pkl'))